{
  "name": "VenteCD",
  "title": "Vente de CD",
  "previewImage": "",
  "sourceCodeUrl": "https://github.com/ToxykAuBleu/VenteCD",
  "startingDate": "2023/12/12",
  "endingDate": "2023/12/23",
  "technologies": [
    "PHP",
    "HTML",
    "CSS",
    "JavaScript",
    "Bootstrap",
    "MySQL",
    "Visual Studio Code",
    "Git",
    "GitHub"
  ],
  "description": "Application web développée dans le cadre d’un projet de travaux pratiques en PHP, visant à créer un site de vente en ligne de CD. L'objectif principal du projet était de concevoir une plateforme simple et fonctionnelle permettant de présenter une sélection de CD avec des informations détaillées, ainsi qu’une gestion du panier d'achats. Le site affiche l’ensemble des CD sous forme de vignettes avec le titre et l’auteur/groupe, et permet de visualiser la pochette en taille réelle ainsi que des détails supplémentaires en sélectionnant un CD. Un système de panier a été implémenté, permettant aux utilisateurs de sélectionner des albums et de simuler un paiement en vérifiant la validité des informations de carte bancaire, notamment en vérifiant que les 16 chiffres sont corrects et que le dernier chiffre est identique au premier, tout en contrôlant que la date de validité est supérieure à 3 mois à partir du jour actuel. <br/><br/>Pour optimiser les performances du site, les vignettes sont présentées sous forme d'images réduites, ce qui permet de minimiser les temps de transfert et d’améliorer la réactivité du site. Le projet inclut également une partie sécurisée avec un back-office où les administrateurs peuvent ajouter ou supprimer des CD. Les données sont stockées dans une base de données MySQL/MariaDB. Des fonctionnalités de recherche ont été intégrées, permettant de trouver des CD par titre, genre ou album. Le projet utilise la méthode AJAX pour améliorer l’interactivité du site, notamment pour la gestion du panier et la recherche en temps réel des CD. L'interface a été conçue avec Bootstrap 5.3, garantissant un design moderne et responsive. <br/><br/>Pour conclure, ce projet montre une maîtrise des technologies PHP et MySQL, tout en mettant en avant des compétences en design web et optimisation des performances."
}
